[{"id":"112","title":"Hyperapp","pitch":"The tiny framework for building hypertext applications","description":"We have minimized the concepts you need to learn to get stuff done. Views, actions, effects, and subscriptions are all pretty easy to get to grips with and work together seamlessly. Write what, not how—With a declarative API that's easy to read and fun to write, Hyperapp is the best way to build purely functional, feature-rich, browser-based apps in JavaScript. Smaller than a favicon—1 kB, give or take. Hyperapp is an ultra-lightweight Virtual DOM, highly-optimized diff algorithm, and state management library obsessed with minimalism.","author":"Jorge Bucaran","github":"https://github.com/jorgebucaran/hyperapp","seen":false},{"id":"113","title":"Kretes","pitch":"Programming Environment for building TypeScript applications on Node.js","description":"Kretes is a programming environment for TypeScript applications built on top of Visual Studio Code. It combines a web framework with an editor into an integrated, battery-included solution.","author":"Jakub Neander","github":"https://github.com/kreteshq/kretes","seen":false},{"id":"114","title":"Solid.js","pitch":"A declarative, efficient, and flexible JavaScript library for building user interfaces.","description":"Solid is a declarative JavaScript library for creating user interfaces. It does not use a Virtual DOM. Instead it opts to compile its templates down to real DOM nodes and wrap updates in fine grained reactions. This way when your state updates only the code that depends on it runs.","author":"Ryan Carniato","github":"https://github.com/ryansolid/solid","seen":false},{"id":"115","title":"Marko.js","pitch":"A declarative, HTML-based language that makes building web apps fun","description":"Marko is HTML re-imagined as a language for building dynamic and reactive user interfaces. Just about any valid HTML is valid Marko, but Marko extends the HTML language to allow building modern applications in a declarative way.","author":"Marko Team","github":"https://github.com/marko-js/marko","seen":false},{"id":"116","title":"Svelte","pitch":"Cybernetically enhanced web apps","description":"Svelte is a new way to build web applications. It's a compiler that takes your declarative components and converts them into efficient JavaScript that surgically updates the DOM.","author":"Rich Harris","github":"https://github.com/sveltejs/svelte","seen":false}]